Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In addition, some Git commands (such as git-show[1]) also take revision parameters which denote other objects than commits, e.g. blobs ("files") or trees ("directories of files").
zh_cn: 另外，一些 Git 命令(例如 git-show[1] )也采用修订参数，这些参数表示除提交外的其他对象，例如。 blob("文件 ")或树(" 文件目录")。

source: In addition, the date part is accepted in the following formats: YYYY.MM.DD, MM/DD/YYYY and DD.MM.YYYY.
zh_cn: 此外，日期部分以以下格式被接受： YYYY.MM.DD ， MM/DD/YYYY 和 DD.MM.YYYY 。

source: In addition, there are a number of optional keys:
zh_cn: 另外还有一些可选的键：

source: In all cases, the new modification will appear reverted in the working tree.
zh_cn: 在所有情况下，新修改将在工作树中显示为还原。

source: In case <old> and <new> are the same, and <old> is a file under $GIT_DIR/remotes or $GIT_DIR/branches, the remote is converted to the configuration file format.
zh_cn: 如果<old>和<new>相同，<old>是 $GIT_DIR/remotes 或 $GIT_DIR/branches 下的文件，则将远程转换为配置文件格式。

source: In case of conflict, git rebase will stop at the first problematic commit and leave conflict markers in the tree.
zh_cn: 如果发生冲突，git rebase 将在第一个有问题的提交时停止，并将冲突标记留在树中。

source: In combination with -d (or --delete), allow deleting the branch irrespective of its merged status.
zh_cn: 与 -d (或 --delete )组合，允许删除分支，而不管其合并状态如何。

source: In combination with -m (or --move), allow renaming the branch even if the new branch name already exists.
zh_cn: 与 -m (或 --move )组合使用时，即使新的分支名称已经存在，也允许重命名分支。

source: In fact, git bisect can be used to find the commit that changed any property of your project; e.g., the commit that fixed a bug, or the commit that caused a benchmark’s performance to improve.
zh_cn: 实际上，可以使用 git bisect 找到改变项目的 任何 属性的提交;例如，修复错误的提交或导致基准测试的性能提高的提交。

source: In fact, the command refuses to run when given pathnames (but see -i option).
zh_cn: 实际上，命令拒绝运行给定的路径名​​(但请参阅 -i 选项)。

source: In general, URLs contain information about the transport protocol, the address of the remote server, and the path to the repository.
zh_cn: 通常，URL 包含有关传输协议，远程服务器的地址以及仓库的路径的信息。

source: In general, the interrogate commands do not touch the files in the working tree.
zh_cn: 一般来说，询问命令不会触及工作树中的文件。

source: In general, when the prompt ends with a single >, you can pick only one of the choices given and type return, like this:
zh_cn: 通常，当提示以单个 > 结尾时，您只能选择一个给定的选项并键入 return，如下所示：

source: In interactive mode, you can mark commits with the action "edit".
zh_cn: 在交互模式下，您可以使用操作"edit"标记提交。

source: In its default mode, git pull is shorthand for git fetch followed by git merge FETCH_HEAD.
zh_cn: 在其默认模式下， git pull 是 git fetch 后跟 git merge FETCH_HEAD 的缩写，。

source: In its first form, the command provides the content or the type of an object in the repository.
zh_cn: 在其第一个形式中，命令提供存储库中对象的内容或类型。

source: In more detail: Your working tree is normally derived from the state of the tree referred to by HEAD.
zh_cn: 更详细地说：你的 working tree 通常来源于 HEAD 引用的树状态。

source: In other words, --merge does something like a git read-tree -u -m <commit>, but carries forward unmerged index entries.
zh_cn: 换句话说，--merge 会像 git read-tree -u -m <commit> 这样做，但是会传递未标记的索引条目。

source: In other words, foo/ will match a directory foo and paths underneath it, but will not match a regular file or a symbolic link foo (this is consistent with the way how pathspec works in general in Git).
zh_cn: 换句话说， foo/ 将匹配目录 foo 和其下方的路径，但不匹配常规文件或符号链接 foo (这与路径规则在 Git 中的工作方式一致)。

source: In other words, any protocol not mentioned will be disallowed (i.e., this is a whitelist, not a blacklist).
zh_cn: 换句话说，任何未提及的协议将被禁止(即，这是白名单，而不是黑名单)。

source: In other words, it can tell you what the 3rd last revision in this repository was, and what was the current state in this repository, yesterday 9:14pm.
zh_cn: 换句话说，它可以告诉你，这个 仓库中的倒数第三个版本是什么，以及在 这个 仓库中的昨天下午 9:14 的当前状态是什么。

source: In other words, the differences are what you could tell Git to further add to the index but you still haven’t.
zh_cn: 换句话说，差异是你可以告诉 Git 进一步添加到索引，但你还没有。

source: In such a case, you can stash your changes away, perform a pull, and then unstash, like this:
zh_cn: 在这种情况下，您可以将更改储藏起来，执行拉取，然后取消储藏，如下所示：

source: In the context of Git used as a synonym for object name.
zh_cn: 在 Git 上下文中用作 object name 的同义词。

source: In the first and second form, copy entries from <tree-ish> to the index.
zh_cn: 在第一和第二种形式中，将条目从<tree-ish>复制到索引。

source: In the first form, it renames <source>, which must exist and be either a file, symlink or directory, to <destination>.
zh_cn: 在第一个形式中，它将重命名<source> 为<destination>，它必须存在，并且是文件，符号链接或目录。

source: In the last case, any format accepted by git-format-patch[1] can be passed to git send-email.
zh_cn: 在最后一种情况下，任何由 git-format-patch[1] 接受的格式都可以传递给 git send-email。

source: In the long form, the leading colon : is followed by a open parenthesis (, a comma-separated list of zero or more "magic words", and a close parentheses ), and the remainder is the pattern to match against the path.
zh_cn: 在长形式中，领先的冒号 : 之后是一个开括号 ( ，以逗号分隔的零个或多个 "魔术词" 列表，并且一个闭括号），其余的是与路径匹配的模式。

source: In the second form, a list of objects (separated by linefeeds) is provided on stdin, and the SHA-1, type, and size of each object is printed on stdout.
zh_cn: 在第二种形式中，stdin 中提供了一个对象列表(以换行符分隔)，每个对象的 SHA-1，类型和大小都打印在 stdout 上。

source: In the second form, the last argument has to be an existing directory; the given sources will be moved into this directory.
zh_cn: 在第二种形式中，最后一个参数必须是现有的目录;给定的源将被移动到这个目录中。

source: In the short form, the leading colon : is followed by zero or more "magic signature" letters (which optionally is terminated by another colon :), and the remainder is the pattern to match against the path.
zh_cn: 在简短的形式中，领先的冒号 : 之后是零个或多个 "魔术签名" 字母(可选地由另一个冒号 : 终止)，其余的是模式匹配路径。

source: In the third form, set the current branch head (HEAD) to <commit>, optionally modifying index and working tree to match.
zh_cn: 在第三种形式中，将当前分支头(HEAD)设置为<commit>，可选择修改索引和工作树进行匹配。

source: In this case you can use the --track or --no-track options, which will be passed to git branch.
zh_cn: 在这种情况下，您可以使用将被传递给 git branch 的 --track 或 --no-track 选项。

source: In this case, the -b and --track options are meaningless and giving either of them results in an error.
zh_cn: 在这种情况下， -b 和 --track 选项是无意义的，并且给出其中任何一个会导致错误。

source: Include the output of git-status[1] in the commit message template when using an editor to prepare the commit message.
zh_cn: 使用编辑器准备提交消息时，在提交消息模板中包含 git-status[1] 的输出。

source: Including the equals but with an empty value (like git -c foo.bar= ...) sets foo.bar to the empty string which ` git config --bool` will convert to false.
zh_cn: 包含等于但含有空值(如 git -c foo.bar= ... )将 foo.bar 设置为空字符串，` git config --bool` 将转换为 false。

source: Incorporates changes from a remote repository into the current branch.
zh_cn: 将远程仓库中的更改合并到当前分支中。

source: Incorporates changes from the named commits (since the time their histories diverged from the current branch) into the current branch.
zh_cn: 将来自指定提交的变化合并(自从他们的历史从当前分支分离)到当前分支。

source: Indeed, you can undo the commit, or you can add other commits.
zh_cn: 实际上，您可以撤消提交，也可以添加其他提交。

source: Indicates a blob object name.
zh_cn: 表示 blob 对象名称。

source: Indicates a commit object name.
zh_cn: 表示提交对象名称。

source: Indicates a commit or tag object name.
zh_cn: 表示提交或标签对象名称。

source: Indicates a filename - almost always relative to the root of the tree structure GIT_INDEX_FILE describes.
zh_cn: 表示文件名 - 几乎总是相对于 GIT_INDEX_FILE 描述的树结构的根目录。

source: Indicates a tree object name.
zh_cn: 表示树对象名称。

source: Indicates a tree, commit or tag object name.
zh_cn: 表示树，提交或标签对象名称。

source: Indicates that an object type is required.
zh_cn: 表示需要对象类型。

source: Indicates the object name for any type of object.
zh_cn: 表示任何类型对象的对象名称。

source: Individual Developer (Participant)
zh_cn: 个人开发人员(参与者)

source: Individual Developer (Standalone)
zh_cn: 个人开发人员(独立)

source: Information
zh_cn: 信息

source: Initialize, update or inspect submodules
zh_cn: 初始化，更新或检查子模块

source: Inspection and Comparison
zh_cn: 检查与比较

source: Inspects, updates and manages submodules.
zh_cn: 检查，更新和管理子模块。

source: Instantly browse your working repository in gitweb
zh_cn: 在 gitweb 中即时浏览您的工作仓库

source: Instead of comparing with the tip of "test" branch, compare with the tip of the current branch, but limit the comparison to the file "test".
zh_cn: 与“test”分支的顶部进行比较，而不是与当前分支的顶部进行比较，但限制为文件“test”的比较。

source: Instead of pointing the newly created HEAD to the branch pointed to by the cloned repository’s HEAD, point to <name> branch instead.
zh_cn: 不是将新创建的 HEAD 指向克隆的存储库 HEAD 指向的分支，而是指向 <name> 分支。

source: Instead of staging files after each individual change, you can tell git commit to notice the changes to the files whose contents are tracked in your working tree and do corresponding git add and git rm for you.
zh_cn: 而不是在每次更改之后暂存文件，您可以告诉 git commit 告之在工作树中跟踪其内容的文件的更改，并且执行相应的 git add 和< c2> git rm 。

source: Instead of the content, show the object size identified by <object>.
zh_cn: 不显示内容，显示由 <object> 标识的对象大小。

source: Instead of the content, show the object type identified by <object>.
zh_cn: 不显示内容，显示由 <object> 标识的对象类型。

source: Instead of using the remote name origin to keep track of the upstream repository, use <name>.
zh_cn: 不要使用远程名称 origin 跟踪上游仓库，使用 <name> 。

source: Instead of using the tip of the current branch, compare with the tip of "test" branch.
zh_cn: 不是使用当前分支的顶部，而使用"test"分支的顶部进行比较。

source: Instead, just show if they exist in the index and would otherwise be removed by the command.
zh_cn: 相反，只是显示它们是否存在于索引中，否则将被命令删除。

source: Integrator
zh_cn: 集成

source: Interacting with Others
zh_cn: 与他人交流

source: Interactive mode
zh_cn: 交互模式

source: Interactively choose hunks of patch between the index and the work tree and add them to the index.
zh_cn: 在索引和工作树之间交互选择补丁，并将它们添加到索引中。

source: Interactively select hunks in the difference between the <tree-ish> (or the index, if unspecified) and the working tree.
zh_cn: 在<tree-ish>(或索引，如果未指定)和工作树之间的差异中交互选择 hunks。

source: Interactively select hunks in the difference between the index and <tree-ish> (defaults to HEAD).
zh_cn: 在索引和 <tree-ish> (默认为 HEAD) 之间的差异中交互选择 hunks。

source: Internal helper commands
zh_cn: 内部帮助命令

source: Interrogation commands
zh_cn: 询问命令

source: Interrogators:
zh_cn: 询问命令：

source: Interrupted workflow
zh_cn: 工作流中断

source: Invoking git add -e or selecting e from the interactive hunk selector will open a patch in your editor; after the editor exits, the result is applied to the index.
zh_cn: 调用 git add -e 或从交互式 hunk 选择器中选择 e 将在编辑器中打开一个补丁;编辑器退出后，结果将应用于索引。

source: It allows you to create a commit with an empty commit message without using plumbing commands like git-commit-tree[1].
zh_cn: 它允许您使用空提交消息创建提交，而不使用管道命令，如 git-commit-tree[1] 。

source: It also presents the merge commit in a special format as produced by git diff-tree --cc.
zh_cn: 它还以由 git diff-tree --cc 生成的特殊格式呈现合并提交。

source: It arranges git pull to fetch and store the branches of mothership machine to local remotes/origin/* remote-tracking branches.
zh_cn: 安排 git pull 将母机分支抓取并存储到本地的 remotes/origin/* 远程跟踪分支。

source: It can be an absolute path or a path relative to the current working directory.
zh_cn: 它可以是绝对路径或当前工作目录的相对路径。

source: It can be an absolute path or relative path to current working directory.
zh_cn: 它可以是绝对路径或当前工作目录的相对路径。

source: It continues narrowing down the range until it finds the exact commit that introduced the change.
zh_cn: 它继续缩小范围，直到找到引入更改的确切提交。

source: It exits with zero status if the reflog exists, and non-zero status if it does not.
zh_cn: 如果 reflog 存在，它将退出零状态，如果不存在则为非零状态。

source: It is <unix timestamp> <time zone offset>, where <unix timestamp> is the number of seconds since the UNIX epoch.
zh_cn: 它是 <unix timestamp> <time zone offset> ，其中 <unix timestamp> 是自 UNIX 历元以来的秒数。

source: It is a good idea not to create this file if you sometimes use older versions of Git, as support for this file was added fairly recently.
zh_cn: 如果您有时使用旧版本的 Git，则不建议创建此文件，因为最近才添加对该文件的支持。

source: It is a good idea to introduce yourself to Git with your name and public email address before doing any operation.
zh_cn: 在进行任何操作之前，将您的姓名和公共电子邮件地址介绍给 Git 是个好主意。

source: It is a rough equivalent for:
zh_cn: 这是一个粗略的等同于：

source: It is not possible to re-include a file if a parent directory of that file is excluded.
zh_cn: 如果该文件的父目录被排除，则不可能重新包含文件。

source: It is possible that a merge failure will prevent this process from being completely automatic.
zh_cn: 合并失败可能会阻止此过程完全自动化。

source: It is probably not the command you want to use; see "save" above.
zh_cn: 它可能不是您想要使用的命令；参见上面的“保存”。

source: It is typically run after git merge.
zh_cn: 它通常在 git merge 之后运行。

source: It is used by several Git commands when, on interactive mode, an editor is to be launched.
zh_cn: 当在交互模式下，编辑器将被启动时，它被几个 Git 命令使用。

source: It may be given as a branch name, a commit-id, or a tag.
zh_cn: 它可以作为分支名称，提交 ID 或标签来给出。

source: It only adds the content of the specified file(s) at the time the add command is run; if you want subsequent changes included in the next commit, then you must run git add again to add the new content to the index.
zh_cn: 它只在运行 add 命令时添加指定文件的内容;如果要下次提交中包含的后续更改，则必须再次运行 git add 以将新内容添加到索引。

source: It provides a bidirectional flow of changes between a Subversion and a Git repository.
zh_cn: 它提供 Subversion 和 Git 仓库之间的双向变更流程。

source: It rewrites history, which does not bode well when you published that history already.
zh_cn: 它重写历史，当你已经发表了这个历史时，这不是很好。

source: It shows that foo.png has differences from HEAD (but that is binary so line count cannot be shown) and there is no difference between indexed copy and the working tree version (if the working tree version were also different, binary would have been shown in place of nothing).
zh_cn: 它显示 foo.png 与 HEAD 有差异(但是二进制，因此不能显示行数)，并且索引副本和工作树版本之间没有差异(如果工作树版本也不同， binary 将被显示代替 nothing )。

source: It typically adds the current content of existing paths as a whole, but with some options it can also be used to add content with only part of the changes made to the working tree files applied, or remove paths that do not exist in the working tree anymore.
zh_cn: 它通常将现有路径的当前内容作为一个整体添加，但是通过一些选项，它也可以用于仅添加对应用的工作树文件所做更改的一部分内容，或移除工作树中不存在的路径了。

source: It updates the named paths in the working tree from the index file or from a named <tree-ish> (most often a commit).
zh_cn: 它从索引文件或指定的<tree-ish>(通常是提交)更新工作树中的指定路径。

source: It uses what is called an extended SHA-1 syntax.
zh_cn: 它使用所谓的 extended SHA-1 语法。

source: It will not exclude the current working directory or a GIT_DIR set on the command line or in the environment.
zh_cn: 它不会排除当前工作目录或在命令行或环境中设置的 GIT_DIR 。

source: It will not overwrite things that are already there.
zh_cn: 它不会覆盖已经存在的东西。

source: It won’t affect existing index files.
zh_cn: 它不会影响现有的索引文件。

source: It works a little bit like printf format, with the notable exception that you get a newline with %n instead of \n.
zh_cn: 它的工作原理有点像 printf 格式，唯一的例外是你使用 %n 而不是 \n 来获取一个换行符。

source: Iterate over all refs that match <pattern> and show them according to the given <format>, after sorting them according to the given set of <key>.
zh_cn: 迭代所有匹配 <pattern> 的引用，按给定 <key> 排序后，按给定的 <format> 显示它们。

source: Its argument must be an exact entry (e.g. "git reflog delete master@{2}").
zh_cn: 其参数必须是 exact 条目(例如 "git reflog delete master@{2}")。

source: Its default value is $XDG_CONFIG_HOME/git/ignore.
zh_cn: 其默认值为 $XDG_CONFIG_HOME/git/ignore。

source: Join two or more development histories together
zh_cn: 合并两个或多个开发历史

source: Just in case if you are doing something exotic, it should be noted that all of the <commit> in the above description, except in the last two forms that use ".." notations, can be any <tree>.
zh_cn: 为了防止异常情况发生，请注意，上述描述中的所有<commit>除了使用".."符号的最后两种形式都可以是任何<tree>。

source: Keep changes in working tree while discarding some previous commits
zh_cn: 在删除一些以前的提交时，保持工作树中的更改

source: Keeping a patch series up to date using git rebase
zh_cn: 使用 git rebase 保持最新的补丁系列

source: Leading and trailing whitespaces are ignored.
zh_cn: 前导和尾随的空白被忽略。

source: Lets you rewrite Git revision history by rewriting the branches mentioned in the <rev-list options>, applying custom filters on each revision.
zh_cn: 让您通过重写 <rev-list options> 中提到的分支来重写 Git 修订历史记录，在每个修订版本上应用自定义过滤器。

source: Like --allow-empty this command is primarily for use by foreign SCM interface scripts.
zh_cn: 像 --allow-empty 这个命令主要是由外部 SCM 接口脚本使用的。

source: Like --get-all, but interprets the name as a regular expression and writes out the key names.
zh_cn: 像 --get-all 一样，但将该名称解释为正则表达式并写出关键名称。

source: Like GIT_CEILING_DIRECTORIES, this will not affect an explicit repository directory set via GIT_DIR or on the command line.
zh_cn: 像 GIT_CEILING_DIRECTORIES 一样，这不会影响通过 GIT_DIR 或命令行设置的显式仓库目录。

source: Like pop, but do not remove the state from the stash list.
zh_cn: 像 pop 一样，但是不要从该隐藏列表中移除该状态。

source: Like -C, but with -c the editor is invoked, so that the user can further edit the commit message.
zh_cn: 如同 -C ，但是使用 -c 会调用编辑器，以便用户可以进一步编辑提交消息。

source: Like get, but returns all values for a multi-valued key.
zh_cn: 类似 get，但返回多值键的所有值。

source: Like with using rm filename, git rm --cached filename will fail if the file is absent from the tree of a commit.
zh_cn: 像使用 rm filename 一样，如果文件不在提交的树中，那么 git rm --cached filename 将失败。

source: Likewise for any other integration branches e.g. maint, next and pu (potential updates).
zh_cn: 对于任何其他集成分支，例如， maint ， next 和 pu (潜在更新)。

source: Likewise, you can pretend that mothership "fetched" from you (useful when access is one sided).
zh_cn: 同样，你可以假装母机从你获取(当访问是单面的时候很有用)。

source: Limit diff output to named subtrees.
zh_cn: 将 diff 输出限制为指定的子树。

source: Limit fetching to the specified number of commits from the tip of each remote branch history.
zh_cn: 限制从每个远程分支历史记录的尖端抓取指定数量的提交。

source: Limit the number of commits to output.
zh_cn: 限制输出的提交次数。

source: Limiting the diff output
zh_cn: 限制 diff 输出

source: Limits the number of commits to show to 3.
zh_cn: 将提交的数量限制为3。

source: Lines that begin with # are ignored.
zh_cn: 以 # 开头的行将被忽略。

source: List all variables set in config file, along with their values.
zh_cn: 列出配置文件中设置的所有变量及其值。

source: List both remote-tracking branches and local branches.
zh_cn: 列出远程跟踪分支和本地分支。

source: List branches.
zh_cn: 列出分支。

source: List or delete (if used with -d) the remote-tracking branches.
zh_cn: 列出或删除(如果与 -d 一起使用)远程跟踪分支。

source: List references in a local repository
zh_cn: 列出本地仓库中的引用

source: List references in a remote repository
zh_cn: 列出远程仓库中的引用

source: List tags.
zh_cn: 列出标签。

source: List the contents of a tree object
zh_cn: 列出树对象的内容

source: List the stash entries that you currently have.
zh_cn: 列出您当前拥有的储藏条目。

source: List, create, or delete branches
zh_cn: 列出，创建或删除分支

source: Lists commit objects in reverse chronological order
zh_cn: 以反时间顺序列出提交对象

source: Local modifications to the files in the working tree are kept, so that the resulting working tree will be the state recorded in the commit plus the local modifications.
zh_cn: 对工作树中的文件进行本地修改会保留，所以生成的工作树的状态将是提交中的记录加上本地修改。

source: Local modifications to the files in the working tree are kept, so that they can be committed to the <branch>.
zh_cn: 保留对工作树中文件的本地修改，以便它们可以被提交到<branch>。

source: Logos
zh_cn: 标志

source: Look for specified patterns in the tracked files in the work tree, blobs registered in the index file, or blobs in given tree objects.
zh_cn: 查找指定的模式，在工作树中的跟踪文件中，在索引文件中注册的 blob ，或在给定树对象中的 blob。

source: Looks for time_t in all tracked .c and .h files in the working directory and its subdirectories.
zh_cn: 在工作目录及其子目录中的所有跟踪的 .c 和 .h 文件中查找 time_t 。

source: Looks for a line that has #define and either MAX_PATH or PATH_MAX.
zh_cn: 查找具有 #define ，并且有 MAX_PATH 或 PATH_MAX 的行。

source: Looks for a line that has NODE or Unexpected in files that have lines that match both.
zh_cn: 找查一行（译注：应该是查找一个文件），存在行匹配 NODE 和 Unexpected （译注：可以不同行，分别匹配。）。

source: Low-level Git operations
zh_cn: 低级 Git 操作

source: Low-level commands (plumbing)
zh_cn: 低级命令(plumbing)

source: MANAGING BRANCHES
zh_cn: 管理分支

source: MERGE STRATEGIES
zh_cn: 合并策略

source: Main porcelain commands
zh_cn: 主要高级指令

source: Maintaining topic branches for a Linux subsystem maintainer
zh_cn: 维护 Linux 子系统维护者的主题分支

source: Maintenance branch management after a feature release
zh_cn: 在功能发布后维护分支管理

source: Make a bare Git repository.
zh_cn: 创建一个 bare Git 仓库。

source: Make a GPG-signed tag, using the default e-mail address’s key.
zh_cn: 使用默认的电子邮件地址键进行 GPG 签名的标签。

source: Make a GPG-signed tag, using the given key.
zh_cn: 使用给定的密钥进行 GPG 签名的标签。

source: Make a commit by taking the updated working tree contents of the paths specified on the command line, disregarding any contents that have been staged for other paths.
zh_cn: 通过获取命令行中指定的路径的更新的工作树内容，忽略已经为其他路径暂存的任何内容进行提交。

source: Make a local clone that borrows from the current directory, without checking things out:
zh_cn: 使本地克隆从当前目录中借用，而无需检出：

source: Make an unsigned, annotated tag object
zh_cn: 创建一个无符号的，带注释的标签对象

source: Making changes
zh_cn: 做出更改

source: Manage multiple working trees
zh_cn: 管理多个工作树

source: Manage reflog information
zh_cn: 管理 reflog 信息

source: Manage set of tracked repositories
zh_cn: 管理一组跟踪的仓库

source: Manage the set of repositories ("remotes") whose branches you track.
zh_cn: 管理您跟踪的分支的一组仓库("remotes")。

source: Managing branches
zh_cn: 管理分支

source: Manipulating branches
zh_cn: 操纵分支

source: Manipulation commands
zh_cn: 操纵命令

source: Manipulators:
zh_cn: 操纵命令：

source: Many Git commands take revision parameters as arguments.
zh_cn: 许多 Git 命令将修订参数作为参数。

source: Many ideas apply in general, though the full workflow is rarely required for smaller projects with fewer people involved.
zh_cn: 一般来说，许多想法都适用，尽管涉及较少人数的小型项目很少需要完整的工作流程。

source: May be any valid commit, and not just an existing branch name.
zh_cn: 可以是任何有效的提交，而不仅仅是现有的分支名称。

source: May be any valid commit, not just an existing branch name.
zh_cn: 可以是任何有效的提交，而不仅仅是现有的分支名称。

source: Merge branch maint into the current branch, but do not make a new commit automatically:
zh_cn: 将分支 maint 合并到当前分支中，但不要自动进行新的提交：

source: Merge branch obsolete into the current branch, using ours merge strategy:
zh_cn: 合并分支 obsolete 到当前分支，使用 ours 合并策略：

source: Merge branches fixes and enhancements on top of the current branch, making an octopus merge:
zh_cn: 合并分支 fixes 和 enhancements 在当前分支的顶部，做 octopus 合并：

source: Merge into the current branch the remote branch next:
zh_cn: 合并到当前分支，远程分支 next ：

source: Merge workflow
zh_cn: 合并工作流程

source: Merging
zh_cn: 合并

source: Merging multiple trees
zh_cn: 合并多棵树

source: Merging upwards
zh_cn: 向上并入

source: Modified content is represented by "-" lines (removing the old content) followed by "+" lines (adding the replacement content).
zh_cn: 修改内容由“-”行(删除旧内容)后跟“+”行(添加替换内容)表示。

source: Modifies the index or directory cache.
zh_cn: 修改索引或目录缓存。

source: More detail on the following is available from the Git concepts chapter of the user-manual and gitcore-tutorial[7].
zh_cn: 有关以下内容的更多详细信息，请参见 Git 用户手册的概念章节 和 gitcore-tutorial[7].

source: More precisely, git pull runs git fetch with the given parameters and calls git merge to merge the retrieved branch heads into the current branch.
zh_cn: 更准确地说， git pull 使用给定的参数运行 git fetch ，并调用 git merge 将检索到的分支头合并到当前分支中。

source: Most end users want to use one of the existing frontend programs, which parses a specific type of foreign source and feeds the contents stored there to git fast-import.
zh_cn: 大多数终端用户希望使用现有的前端程序之一，该程序解析特定类型的外来源，并将存储在那里的内容提供给 git fast-import 。

source: Move objects and refs by archive
zh_cn: 通过归档移动对象和引用

source: Move or rename a file, a directory, or a symlink
zh_cn: 移动或重命名文件，目录或符号链接

source: Move or rename a file, directory or symlink.
zh_cn: 移动或重命名文件，目录或符号链接。

source: Move/rename a branch and the corresponding reflog.
zh_cn: 移动/重命名一个分支和相应的 reflog。

source: Multiple lines can be added to an option by using the --add option.
zh_cn: 可以通过使用 --add 选项将多行添加到选项。

source: Multiple patterns may be given; if any of them matches, the tag is shown.
zh_cn: 可以给出多种模式;如果其中任何一个匹配，则显示标签。
